conf/src/Catalogs/ЭП_ВиртуальныеЭтапы/ЭП_ВиртуальныеЭтапы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_ВиртуальныеЭтапы</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_КодBI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

conf/src/InformationRegisters/ЭП_ВиртуальныеЭтапыПроектов/ЭП_ВиртуальныеЭтапыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ВиртуальныеЭтапыПроектов</name>
  <resources>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодБИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВиртуальныйЭтап</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВиртуальныйЭтапСсылка</name>
    <type>
      <types>CatalogRef.ЭП_ВиртуальныеЭтапы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Catalogs/ЭП_ВиртуальныеЭтапы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	МенеджерЗаписи = РегистрыСведений.ЭП_ВиртуальныеЭтапыПроектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Проект = Объект.Владелец;
	МенеджерЗаписи.КодБИ = Объект.ЭП_КодBI;
	МенеджерЗаписи.ДатаПо = Объект.ДатаОкончания;
	МенеджерЗаписи.ДатаС = Объект.ДатаНачала;
	МенеджерЗаписи.ВиртуальныйЭтап = Объект.Наименование;
	МенеджерЗаписи.ВиртуальныйЭтапСсылка = Объект.Ссылка;  
	МенеджерЗаписи.Записать(); 
КонецПроцедуры
